fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыИРеализации</name>
    <attributes>
      <name>Договоры</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументыНаСервере(НачалоПериода, КонецПериода) Экспорт

	Результат = ПолучитьДокументы(НачалоПериода, КонецПериода);
	
	МассивРеализаций = Новый Массив;

	Пока Результат.Следующий() Цикл
		РеализацииСтруктура = Новый Структура;
			
		РеализацииСтруктура.Вставить("Договор", Результат.Договор);
		Реализация = СозданиеРеализации(Результат, КонецПериода);
		РеализацииСтруктура.Вставить("Реализация", Реализация);
			

		МассивРеализаций.Добавить(РеализацииСтруктура);

	КонецЦикла;

	Возврат МассивРеализаций;

КонецФункции

Функция ПолучитьДокументы(НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДанныеДоговоров
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ПериодДействияПо > &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ПериодДействияС < &КонецПериода
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ДанныеРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДоговоров.Ссылка КАК Договор,
	|	ВТ_ДанныеРеализации.Ссылка КАК Реализация,
	|	ВТ_ДанныеДоговоров.Организация КАК Организация,
	|	ВТ_ДанныеДоговоров.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ДанныеДоговоров КАК ВТ_ДанныеДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеРеализации КАК ВТ_ДанныеРеализации
	|		ПО ВТ_ДанныеДоговоров.Ссылка = ВТ_ДанныеРеализации.Договор";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

Функция СозданиеРеализации(Результат, Дата)
	
	Если Результат.Реализация = NULL Тогда
		НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Иначе
		НовыйДок = Результат.Реализация.ПолучитьОбъект();
	КонецЕсли;	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Договор", Результат.Договор);
	ДанныеЗаполнения.Вставить("Контрагент", Результат.Контрагент);
	ДанныеЗаполнения.Вставить("Организация", Результат.Организация);
	НовыйДок.Заполнить(ДанныеЗаполнения);
	НовыйДок.Дата = Дата;
	НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
	
	Если НовыйДок.ПроверитьЗаполнение() Тогда
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
		
	Возврат НовыйДок.Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли
